console.log('Score: 26/110');
console.log('');

console.log('1. Реализация burger menu на обеих страницах: 26/26');
console.log('[+] при ширине страницы меньше 768рх панель навигации скрывается, появляется бургер-иконка: +2');
console.log('[+] при нажатии на бургер-иконку, справа плавно появляется адаптивное меню шириной 320px, бургер-иконка плавно поворачивается на 90 градусов: +4');
console.log('[+] высота адаптивного меню занимает всю высоту экрана: +2');
console.log('[+] при повторном нажатии на бургер-иконку или на свободное от бургер-меню пространство адаптивное меню плавно скрывается уезжая за правую часть экрана, бургер-иконка плавно поворачивается на 90 градусов обратно: +4');
console.log('[+] бургер-иконка создана при помощи html+css, без использования изображений: +2');
console.log('[+] ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям, сохраняются заданные на первом этапе выполнения задания требования интерактивности элементов меню: +2');
console.log('[+] при клике по любой ссылке (интерактивной или неинтерактивной) в меню адаптивное меню плавно скрывается вправо, бургер-иконка поворачивается на 90 градусов обратно: +2');
console.log('[+] расположение и размеры элементов в бургер-меню соответствует макету (центрирование по вертикали и горизонтали элементов меню, расположение иконки). При этом на странице Pets цветовая схема может быть как темная, так и светлая: +2');
console.log('[+] область, свободная от бургер-меню, затемняется: +2');
console.log('[+] страница под бургер-меню не прокручивается: +4');
console.log('');











